{"clicked": false, "created_utc": 1473708544.0, "distinguished": null, "edited": false, "id": "52g657", "is_video": false, "locked": false, "num_comments": 1914, "over_18": false, "permalink": "/r/movies/comments/52g657/there_should_be_a_movie_starring_vin_diesel_and/", "score": 41332, "selftext": "I've heard over and over that Vin Diesel and Terry Crews are big nerds who play D&D. I've even heard they play together. Mr. Diesel also seems to have a lot of input into his movies, even having directed a few video games himself. I think with those two in there, there is the making of a phenomenal movie that alternates between a group of friends playing D&D around a table that then has each of those actors playing their characters. Vin plays his character, Terry plays his, the others play their own. Whoever is DMing is also the narrator, and also plays all of the bad guys. \n\nIt opens like it's an actual fantasy movie: Robert Downy Jr. (because that's who I picture in my head, I don't know if he's ever done anything like D&D) is narrating something about our heroes journey, describing them each and how they came together, and the camera pans over a fantasy village. In walks, in fantasy costume, Terry Crews, Vin Diesel, The Rock, Matt Damon, and Patton Oswalt. Patton could play the halfling bard (who wouldn't want to hear him sing?), Matt Damon plays an annoying min-maxing elf who takes too long to do the math and doesn't role-play enough (when his character speaks, he sounds \"out of place\", think when a character talks in \"Drunk History\"), and The Rock could be \"the new guy\" (playing an ironically physically weak wizard) at the table to guide the viewer through some of the basics. His charater is still jacked, but he can't do something simple like push a small boulder or lift a tiny wooden cart because his strength stat is 8. \n\nAt the end of the introduction, Terry Crews objects to the description of what he is wearing. It cuts to a big table at one of their houses, everyone sitting around with their character sheets, the board in the middle has their pieces on a graph sheet. Dice everywhere. RDJ has his secret divider set up and the rule-book out in front of them, and they argue about their starting equipment for a minute. RDJ finally caves and it cuts back to the characters, and Terry's character is wearing the \"correct\" armor now. \n\nI would love to see that. The fantasy parts would be taken seriously like it's an acted out D&D campaign, but it also has the realistic out-of-character relationships and discussions that make up a really important part of any campaign with friends. Plus, I want to see Terry Crews roll a dice, get a perfect 20 and get really excited and start yelling, then cut to Crews in full body armor swinging a broadsword and chopping off an ogre's head in one blow and still yelling, then cutting back to Crews IRL again standing up, yelling, then looking around awkwardly and realizing he got too excited. \n\nEvery villian would be the DM (RDJ again I think just fits, he's just smug and arrogant but also friendly enough), the Ogre is a CGI RDJ, the thief in the hood is him, the big bad monster at the end has his voice. And of course, he's also the narrator. It has comedic potential, it has flashy action and CGI, it has big-name actors doing something ironically nerdy but somehow believable. I think it would make money, what with Hollywoods insistence on making a movie adaptation of everything, but I don't see a D&D movie ever working without acknowledging that it's all still \"pretend\" on some level. Everyone knows D&D, and I read recently that its use in \"Stranger Things\" has led to an increase in sales of D&D stuff lately, so the timing is perfect, too!", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "There should be a movie starring Vin Diesel and Terry Crews where they (and their group) play D&D together, but it actually acts out the campaign, switching between the table and the setting, a-la \"The Princess Bride\".", "url": null, "author_name": "AmnesiaCane", "author_id": "4qw94", "subreddit_name": "movies", "upvote_ratio": 0.82}