{"clicked": false, "created_utc": 1522623436.0, "distinguished": null, "edited": 1522628722.0, "id": "88urzc", "is_video": false, "locked": false, "num_comments": 4042, "over_18": false, "permalink": "/r/movies/comments/88urzc/i_got_chastised_for_being_on_my_cell_phone_before/", "score": 41923, "selftext": "Look... I get that complaining about other movie goers has become a legitimate hobby for many cinephiles, but shit has gone too far. \n\n\n\nEarlier today I went to see the film \"The Death of Stalin\". Side note: it's really good, but it's also exactly the kind of movie that packs in pretentious dipshits. Anyway, I was in my seat, on my phone (browsing the reddit app actually) -- NOT DURING THE OPENING CREDITS -- NOT EVEN DURING THE PREVIEWS -- but during AMC's bullshit \"First Look\" segment, in which Maria Menounos takes you on a journey to discover 'what's hot in Hollywood'. I assume everyone knows what I'm talking about. It's basically 30 minutes of glorified commercials interlaced with actual commercials. \n\n\n\nThe couple behind me started talking about how much they hated people who used their cell phone during movies. However, I could only decipher every other sentence and didn't think it was possible that they were passive-aggressively talking about me. But then the guy started clearing his throat in that suggestive way. \n\n\n\n\"No...\" I thought, \"there's no way he's angry at me for flipping through my phone during the 'behind the scenes look' at some stupid pre-teen movie both of us will never see.\" \n\n\n\nWhen the \"First Look\" segment ended, I did what you're supposed to do... I turned my phone on silent and put it in my pocket. Keep in mind, this was before the green placard even showed up to announce the first preview. The dude behind me starts clapping. CLAPPING! \n\n\n\nI'm sure he read some post online about some annoying person ruining the movie and the whole audience started clapping to collectively shame them. I'm sure he said to himself \"oh man, next time someone's on their phone in a movie theater, that's what I'm going to do!\" \n\n\n\nAt this point, I did something completely counterintuitive to my Minnesotan upbringing -- I turned around and said \"Oh, I'm sorry... did I ruin the commercials for you?\" I got no response and turned back around. Shortly thereafter, while the theater showed that clip asking the audience to silence their cell phones, saying 'Please, don't ruin the movie for others' -- I waited for silence and said \"Also, please, don't ruin the M&M commercials for others\". Admittedly, that move was classic Minnesotan. \n\n\n\nSo that's my story. That couple can choke on their sense of entitlement. I'm an extremely polite person when I'm not telling people to choke on things. I care about others enjoyment. But for the love of christ... this 'movie etiquette' movement has overstepped its bounds if I can't check my text messages 20 minutes before the movie starts. \n\n\n\n\n\n\n\n\n\nEDIT: I'm kinda surprised there's as much downvoting as there is with this post. I wrote it during peak anger, but I assure you that I'm actually open to hearing other perspectives. I just can't for the life even invent a reason why phone use pre-previews would cause any harm to someone's moviegoing experience. Is it a Minority Report thing?  Are you trying to prevent future crimes? It just seems to me that people are making up these 'rules' as they go along. Why is phone use considered distracting, but their audible conversation wasn't? To me, it looks a lot like r/gatekeeping -- a need to arbitrarily place oneself above others. ", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "I got chastised for being on my cell phone BEFORE THE PREVIEWS STARTED!", "url": null, "author_name": "BalonyDanza", "author_id": "hm7a2", "subreddit_name": "movies", "upvote_ratio": 0.76}