{"clicked": false, "created_utc": 1519057531.0, "distinguished": "moderator", "edited": 1519058977.0, "id": "7yntae", "is_video": false, "locked": false, "num_comments": 5047, "over_18": false, "permalink": "/r/movies/comments/7yntae/box_office_week_black_panther_smashes_at_1_with/", "score": 30454, "selftext": "*Hey everyone. Just a heads up I will be out of the country for four weeks so sadly no Box Office Week during that time. I might be able to do the post without the commentary but expect no post/limited posts during my trip. I appreciate all the love and support y'all give and I'll miss doing this for the time I'm gone.* \n\n---\n\n| Rank | Title | Domestic Gross (Weekend) | Worldwide Gross (Cume) | Week # | \n:---|:---|:---|:---| :---\n| 1 | Black Panther | $201,797,000 | $404,000,000 | 1 |\n| 2 | Peter Rabbit | $17,250,000 | $48,235,068 | 2 |\n| 3 | Fifty Shades Freed | $16,940,000 | $266,934,455 | 2 |\n| 4 | Jumanji: Welcome to the Jungle  | $7,945,000| $904,623,565 | 9 |\n| 5 | The 15:17 to Paris | $7,685,000| $36,132,717 | 2 |\n\n\n**Notable Box Office Stories:** \n\n* **Black Panther -** Well, that was....wow. If someone bet that Black Panther would have a bigger three-day opening than the last Avengers movie then I'm not sure if they are a time travel or really have their finger on the pulse of the US. Black Panther utterly destroyed its opening weekend and broke several records in its wake as the film opened to #1 with a massive $201.7M. That makes it the second highest opening ever for the MCU (only behind The Avengers with $207.4M) and the fifth highest domestic opening ever. It also makes it the #1 February debut, demolishing the record set by Deadpool with $132.4M. It's also the biggest opening ever for a solo superhero movie and the biggest opening for a debut superhero movie (I know the protagonist was in Captain America: Civil War first, but the classification of this film as the start of a franchise still counts). Black Panther also had the fifteenth highest international debut of all time with $169M, despite not opening yet in China or Japan. This is not only the biggest opening weekend for a film made by a black director, it will become the highest grossing film by a black director ever in just 4 days when it surpasses the lifetime domestic gross of Fate of the Furious ($226M). If all that wasn't enough, this film received an A+ rating on Cinemascore, only the second MCU film to do so besides The Avengers. And let's note that The Avengers had a opening weekend multiplier of 3x which if Black Panther repeats means were are looking at a domestic haul well over $550M. Just...wow.\n\n* **Black Panther (cont.)-** So how did this happen? Well the most obvious answer is that Marvel truly created an event. Major black celebrities, social media trendsetters, and even black churches urged people to go see the film opening weekend. This really was viewed as a major cultural moment for black representation on film. But besides that it seems the film really appealed to a wide demo, with over 61% of the audience this weekend over the age of 25 and 45% of the total audience was women. Not to mention a well reviewed concept album by Kendrick Lamarr for the film coming out right before and the film becoming the best reviewed MCU/superhero film ever on Rotten Tomatoes with a current score of 98%. There were attempts from racist trolls to bomb the review scores on IMDB and RT and even try to spread fake news that white people were being attacked by black people going to see Black Panther but their attempts didn't even put a dent into the opening weekend. The timing was also just perfect, with top films that were over two months old before Black Panther's release. The film really felt like the perfect storm of cultural relevance, hype, and great word of mouth. \n\n* **Black Panther (cont.)-** This incredible weekend debut is a reminder why black directors and representation matters, especially for major blockbusters. Underserved markets are very hungry to see themselves on screen. It's also worth noting that while black audiences were the major drivers of this weekend that $201.7M was not all them. Clearly with numbers that big you have to reach a very wide audience. That so many people could embrace a film whether it represents their cultural/racial make-up or not is telling that a lot of the views about demos and niche audiences in Hollywood are old and outdated. I'm really sad to be leaving this series (just temporarily) right as Black Panther about to blow up the box office even more, but I'm glad I could cover this weekend because it's one for the box office history books. A cynical mind can certainly see this as another notch in the Disney corporate machine belt (and hey you are right, this does mean now Disney has 8 of the 10 best opening weekends ever) but for whatever intentions corporate had what the audiences experienced was a big middle finger to old Hollywood that would reject this film's existence just ten years ago. And now it's opened bigger than Captain America: Civil War, it will make more domestically than Justice League in just 4-5 days, and despite opening in February it could easily be the #1 biggest grosser of 2018. Black Panther is going to prove diverse stories don't just matter on an emotional or social level, they matter on an economic level in a way that no one can possibly ignore or dismiss anymore. \n\n* **Early Man -** Look the two films opening against Black Panther knew they were counter-programming but I don't think even they expected results this bad. First up is the latest from Aardman Animation (the claymation studio behind Wallace & Gromit, Shaun the Sheep, and Chicken Run) and the first film from director Nick Park in a decade, Early Man, which opened horribly to #7 with $3.1M. Now to be fair to Aardman their films have never been major openers (Flushed Away is their best domestic opening with $18.8M) but this sets a studio low for the company who's domestic receipts have been dwindling as their last film The Shaun the Sheep Movie opened to just $4M in 2015. Things aren't looking good for the longtail either as the film scored a B on Cinemascore, likely due to the deceptive advertising. The film is not so much a day in the life of a caveman as a caveman era football match movie, which doesn't seem to be translating well to US audiences. The film wasn't exactly a big hit in the UK either, scoring a measly $10M so far in that country. Early Man just feels too weird, too much of a personal project for Nick Park and in age where even extremely well reviewed stop motion films fail who needs a middling reviewed extended football joke when most people don't even like the animation style to begin with?\n\n* **Samson -** Oh Pure Flix, please never ever stop even if your latest flop Samson opened at #10 with $1.9M. The film touted as PF's biggest budget film to date and boasting such white hot stars like Jackson Rathbone and Billy Zane was an attempt to move PF from their more modern tales about faith in the modern world to telling actual biblical stories. However, once again critics derided the film and it's now the worst wide release opening for the company as well as in the bottom 200 worst openings of all time. But don't worry about Pure Flix as this March sees the release of God's Not Dead: A Light in Darkness, their hotly anticipated third entry in the God's Not Dead Cinematic Universe (or GNDCU). I imagine with that film eeking out a profit this is the last time we will see Pure Flix trying to stretch themselves like this again, and instead go back to their low budget, high reward modern melodramas about faith. \n\n\n* **Oscar Movie Round-up -** Not too much to report this week other than **The Shape of Water** managed to pass $50M domestic this weekend where it was #12 with $1.6M. \n\n**Films Reddit Wants to Follow**\n\nThis is a segment where we keep a weekly tally of currently showing films that aren't in the Top 5 that fellow redditors want updates on. If you'd like me to add a film to this chart, make a comment in this thread.\n\n|Title|Domestic Gross (Cume)|Worldwide Gross (Cume)| Budget | Week #|\n:---|:---|:---|:---|:---\n| Thor: Ragnarok | $314,589,124 | $853,408,372 | $180M | 16 |\n| Justice League | $228,616,472 | $657,416,472 | $300M | 14 |\n| Coco | $207,191,667 | $730,391,667 | $175M | 13 |\n| Star Wars: The Last Jedi | $618,031,777 | $1,326,852,319\t | $200M | 10 |\n| The Greatest Showman | $154,478,356 | $340,124,873 | $84M | 9 |\n| Paddington 2 | $38,875,058 | $212,715,005 | $50M | 6 |\n\n\n**Notable Film Closings**\n\n|Title|Domestic Gross |Worldwide Gross | Budget | \n:---|:---|:---|:---|:---\n| Daddy's Home 2 |  $104,029,443 | $180,613,180 | $69M | \n| Father Figures |  $17,501,244 | $23,001,244 | $25M | \n\n---\n\n*You can read my latest piece at The Numbers: [What Gives a Marvel Movie Legs?](https://www.the-numbers.com/news/229020830-Analysis-What-Gives-a-Marvel-Movie-Legs)*\n\n*As always /r/boxoffice is a great place to share links and other conversations about box office news.*\n\n*Also you can see the archive of all Box Office Week posts at /r/moviesboxoffice.* ", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "Box Office Week: Black Panther smashes at #1 with $201M, making it the 2nd best MCU opening ever and the 5th best domestic opening overall. The film is also expected to gross $235M for the four-day weekend. Meanwhile, Early Man (#7, $3.1M) and Samson (#10, $1.9M) flop.", "url": null, "author_name": "mi-16evil", "author_id": "4vrqm", "subreddit_name": "movies", "upvote_ratio": 0.76}