{"clicked": false, "created_utc": 1536309827.0, "distinguished": null, "edited": 1536349639.0, "id": "9dsd2r", "is_video": false, "locked": false, "num_comments": 3339, "over_18": false, "permalink": "/r/movies/comments/9dsd2r/fuck_you_netflix_stop_cutting_off_the_credits/", "score": 47365, "selftext": "You know that feeling when you've just watched two and a half hours of an amazing movie, and the credits roll, and the specially-composed-to-be-epic end-credits sountrack piece starts to play and you're like \"aaahhh... time to revel in the emotion of the ending of that film, and take a minute to think about what it all means as this beautiful epic music plays to recontextualize what I've seen and put it in a more viscer... OH FUCK WHY THE FUCK IS THE TRAILER FOR 'ORANGE IS THE NEW BLACK' FUCKING UP MY SHIT!?!?!?!?!?!?\"\n\nSeriously, STOP FUCKING DOING THAT.  I KNOW YOUR SHOWS FUCKING EXIST.  LET ME HAVE AT LEAST A COUPLE OF MINUTES OF COMEDOWN BEFORE SHOVELING YOUR NEXT SERIES IN MY GODDAMN FACE ALREADY\".\n\nI mean, shit, if even there was a button that said \"let me watch the end credits\" I'd be OK with it, but NOPE THERE'S FUCKING NOTHING.\n\nNetflix, you had our backs five years ago, and now you're just as fucking bad as anyone else.  LISTEN TO ME, STOP THIS SHIT.\n\n(((( MEGA EDIT ))))\n\n Well... holy smokes, le blow up... and some of you have no sense of humour.  A few comments.\n\na) I don't hate Netflix in general.  People saying \"just stop paying for it\" are being ridiculous.  I even get that a lot of people *like* the autoplay feature, which is great.  I just don't like that it's *automatic* and there's no option to turn it off (for me, at least).\n\nb) I think for some reason you guys have options when you watch that I don't.  None of your suggestions work for me, or seem available.  Probably depends how you're watching Netflix.  I'm using a Sony smart TV.  Maybe I truly am \"retarded\", as some of you insist.  But I don't have the settings menu ya'll are talking about, that's for sure.\n\nc) I'm howling at the comments about \"entitlement\".  Uh, what?  I'm paying for a service here, not asking for my student loans to be cleared.  If we don't like something we're paying for, we're \"entitled\" so say something about it.\n\nd) As for the \"don't get so excited\" posts.  Well, firstly, alcohol.  Secondly, obviously the issue isn't that big of a deal, that's why the obviously over the top response.  I dunno, I thought it was funny.  Certainly didn't think anyone would care about it.  What's really interesting is how pissed off people get that I even posted it in the first place.  Oh, sorry, let's get back to how exciting that fifth poster is for (insert 483rd Marvel sequel here).\n\ne) Some of you don't sit through the credits.  That's cool, but some of us (apparently a *lot* of us) do.  \n\nf) If you've never gotten to the end of a film and felt the need to sit there and think about it for a bit... that's... really sad.\n\ng) Weirdly, the thing that set me off was *Blue Thunder*.  I loved this movie as a kid, loved the shitty electronic score... so when I got the end I'm like \"oh yeah, there's this extendo version of the theme which was pretty sweet\" and then I get there and BOOM it's like NO MUSIC ONLY TRAILER.  And it made me thought of other times when I wanted to just relax and think about what I'd seen, and popped.  Er, half-popped.  ", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "FUCK YOU NETFLIX STOP CUTTING OFF THE CREDITS", "url": null, "author_name": "snarpy", "author_id": "a5a6y", "subreddit_name": "movies", "upvote_ratio": 0.71}