{"clicked": false, "created_utc": 1527516804.0, "distinguished": "moderator", "edited": 1527517585.0, "id": "8mqc9u", "is_video": false, "locked": false, "num_comments": 11875, "over_18": false, "permalink": "/r/movies/comments/8mqc9u/box_office_week_solo_a_star_wars_story_debuts_at/", "score": 39282, "selftext": "|Rank|Title|Domestic Gross \\(Weekend\\)|Worldwide Gross \\(Cume\\)|Week #|Percentage Change|Budget|\n|:-|:-|:-|:-|:-|:-|:-|\n|1|Solo: A Star Wars Story|$83,325,000|$148,325,000|1|N/A|$250M \\- $300M|\n|2|Deadpool 2|$42,700,000|$487,145,548|2|\\-66.0&#37;|$110M|\n|3|Avengers: Infinity War|$16,494,000|$1,904,688,638|5|\\-44.0&#37;|$315M – $400M|\n|4|Book Club|$9,450,000|$31,834,516|2|\\-30.4&#37;|$10M|\n|5|Life of the Party|$5,115,000|$45,002,348|3|\\-32.7&#37;|$30M|\n\n**Notable Box Office Stories:**\n\n* **Solo: A Star Wars Story** \\- Normally on a holiday weekend I wait until Tuesday so I can discuss the full scope of how the extra day off affected the major releases. But the results for Solo were so shocking I frankly couldn't wait and wanted to get at that juicy analysis asap.  tracking to open at the worst over $100M for the three\\-day weekend may now not even crack $100M after a four day holiday as Solo: A Star Wars Story opened to #1 with $83.3M. It's been strange because I've seen a lot of couching for this number, that it's soft or underwhelming. Let me be more blunt then, this number right here is bad. Really, really, really bad. How bad? Well first off remember Justice League, the megaflop from last year? That film carried a similar budget of around $300M \\(Solo's estimates are all over the map with Disney reporting $250M while Deadline reports $300M\\+\\) and was also a film that was basically shot twice under two different sets of directors. Well that film, for all its woes, opened at $93.8M, a full $10M higher than Solo. Then there's the comparisons to other Disney era Star Wars films. No one expected the spin\\-offs to do as well as the episodic ones but compared with Rogue One, Solo is just pitiful. Rogue One opened 46&#37; higher than Solo with $155M and that was in December when films are supposed to be flipped from the usual summer release strategy of opening really big to cushion big drops in the coming weekends. Not to mention that Star Wars has always been much more of a domestic pull then other more lucrative international properties like the MCU and the Fast & Furious films, which brings us to the even worse news.\n* **Solo: A Star Wars Story \\(cont.\\)** \\- International was probably never going to save this film but the results are far far worse than everyone predicted as the film opened to a miserable $65M overseas, making the worldwide opening a miserable $148.8M. The film couldn't even crack the best international numbers of the weekend, as Deadpool 2 out grossed it by earning $67M on its second weekend. To put that in context Rogue One opened to $134.9M overseas and Justice League opened to $185M. In fact you can just look at[ the list of overseas openings](http://www.boxofficemojo.com/intl/weekend/opening/) \\(thanks u/Greede for showing me that list\\) and see the many box office disappointments that opened better, including: The Mummy \\($140.7M\\), Pacific Rim Uprising \\($122.4M\\), Thor: The Dark World \\($109.4M\\), 300: Rise of An Empire \\($88.8M\\), Wrath of the Titans \\($76.1M\\), and fellow Disney megabomb alum John Carter \\($70.6M\\). Every Star Wars film seems to set a new low in China and this one took the cake opening there to just $10.1M \\(Rogue One opened to $30M\\). Guess disguising the film under the title \"Ranger Solo\" in China didn't really help with the country's continued disinterest in the franchise. As it stands not only will Solo be the only Disney era Star Wars film to not crack $1B, it could very well earn less worldwide than Rogue One made domestically \\(and note it has already opened lower worldwide than Rogue One opened domestically\\). That is terrible no matter what way you slice it.\n* **Solo: A Star Wars Story \\(cont.\\)**  \\-  So what the hell happened here? While the film got worse reviews then Last Jedi the fan vibe seems to be more generally positive including a solid A\\- score on Cinemascore. Of course there was the very public firings of original directors, Chris Miller and Phil Lord, and the complete reshooting of the film which ballooned the budget to such catastrophic proportions. That change also meant marketing took a while to finally roll out, all while trying to compete against bigger and splashier ad campaigns like Avengers and Deadpool. Star Wars fatigue could certainly be a thing with less than six months in between the last two films and following up a very divisive film at that. The main takeaway for me though is there is no damn reason that a spin\\-off movie should cost more than a main movie. Solo potentially being one of the most expensive films of all time is insane because by its very nature the work is disposable, an ad on, DLC. It should be a fun addendum, not must see material that demands the kind of massive crowd size reserved for the splashiest of releases.\n* **Solo: A Star Wars Story \\(cont.\\)**  \\-   Where Lucasfilm goes from here is going to be very interesting. There's blessedly more space between Solo and Episode IX with a full year and change. The episodes also don't feel as directly threatened. The more curious ones will be the Obi Wan movie by Stephen Daldry and the recently announced Boba Fett movie by James Mangold. The latter director in particular is well known for delivering good earning and audience beloved hit films like Logan on time and under budget which is exactly what Star Wars needs right now. Solo is arguably the biggest single character draw of the franchise and the fact the general public reacted so incredibly ambiguously to Solo should be extremely worrisome for Disney. It shows name alone will not drive sales and it already feels like the other spin\\-off movies that are coming are horribly out of date before they even begin principal photography. Disney/Lucasfilm needs to take a real hard look at the future of this Star Wars cinematic universe because I don't think they ever expected to have potentially one of the biggest box office bombs of all time by just their fourth release.\n\n**Films Reddit Wants to Follow**\n\nThis is a segment where we keep a weekly tally of currently showing films that aren't in the Top 5 that fellow redditors want updates on. If you'd like me to add a film to this chart, make a comment in this thread.\n\n|Title|Domestic Gross \\(Cume\\)|Worldwide Gross \\(Cume\\)|Budget|Week #|\n|:-|:-|:-|:-|:-|\n|The Greatest Showman|$173,965,566|$432,577,352|$84M|23|\n|Jumanji: Welcome to the Jungle|$404,480,885|$959,818,768|$90M|23|\n|Black Panther|$698,589,242|$1,344,626,241|$200M|15|\n|Love, Simon|$40,806,259|$57,509,295|$17M|11|\n|Pacific Rim Uprising|$59,185,715|$288,485,715|$150M|10|\n|Ready Player One|$135,418,594|$577,018,594|$175M|9|\n|A Quiet Place|$179,993,607|$311,693,607|$17M|7|\n\n**Notable Film Closings**\n\nN/A\n\n\\-\\-\\-\n\nAs always r/boxoffice is a great place to share links and other conversations about box office news.\n\nAlso you can see the archive of all Box Office Week posts at r/moviesboxoffice.", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "Box Office Week - Solo: A Star Wars Story debuts at #1 with a worrisome $83.3M domestic on an estimated budget of $250M-$300M. Worldwide it's even worse as the film debuted to a disastrous $65M international, less than what Deadpool 2 made internationally on its second weekend.", "url": null, "author_name": "mi-16evil", "author_id": "4vrqm", "subreddit_name": "movies", "upvote_ratio": 0.86}