{"clicked": false, "created_utc": 1567043076.0, "distinguished": null, "edited": false, "id": "cwu9ny", "is_video": false, "locked": false, "num_comments": 2174, "over_18": false, "permalink": "/r/movies/comments/cwu9ny/everyone_choosing_sides_in_the_disneysony_debate/", "score": 33319, "selftext": "#Did you know that when copyright was invented, it lasted 14 years?\n\nThrough the centuries, copyright was changed many times, making it last longer and longer.  Big businesses would lobby Congress and have the law changed to suit their needs.  **This is not how copyright was supposed to work and, in fact, it now does the opposite of what it was supposed to do.**\n\nSo why are we waiting for a bunch of studio executives to haggle each other and decide who gets to use Spider-Man?\n\n* The character is over 50 years old.\n* Everyone involved in his creation is now dead.\n\nThis guy should have entered the public domain decades ago.  Just like all the old tales (Snow White, Cinderella etc.) that Disney built their business on, Spider-Man should be public domain.\n\nIt shouldn't be Disney vs SONY.  They should *both* be able to use him by now.  So should FOX.  So should Warner Brothers.  So should every studio, and you and me.  Spider-Man is a cornerstone of our culture!\n\nImagine a world where studios actually had to compete with each other.  Where they'd have to work hard and compete to give us the best Spider-Man movies they could.  Right now all the studios just buy up characters like Harry Potter, Luke Skywalker etc. and they have absolute control over them.  Why do we put up with this?\n\nThe films they put out can be absolutely awful, and it doesn't matter.  They don't have to compete.  We let them do this, they lobbied Congress to change the laws and we just rolled over and took it.  Why?\n\n#Copyright should not last so long\n\nThere's no reason it needs to last this long.  The *minimum* duration is 70 years now, but in most cases it's usually 90 years or more.  So people will be born into a world where Spider-Man always existed, maybe watch a Spider-Man movie as a kid and be inspired to go to film school.  They will get careers, start families, live and die maybe working in Hollywood their whole lives, and yet they'll never get to do a damn thing with their favorite character, a cornerstone of their culture - unless they were at the right company at the right time.\n\nRidiculous.", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "Everyone choosing sides in the Disney/SONY debate doesn't recognize the real enemy here: OUR BROKEN COPYRIGHT LAW", "url": null, "author_name": "NealKenneth", "author_id": "kk0xw", "subreddit_name": "movies", "upvote_ratio": 0.87}