{"clicked": false, "created_utc": 1492321947.0, "distinguished": null, "edited": false, "id": "65nqfd", "is_video": false, "locked": false, "num_comments": 2521, "over_18": false, "permalink": "/r/movies/comments/65nqfd/not_watching_trailers_made_movies_significantly/", "score": 37036, "selftext": "I don't know if this was posted somewhere before, but years ago I decided to not watch trailers specifically because they were ruining movies for me one way or another. Growing up trailers were my favorite thing. I loved being hyped for a movie to come out. However, numerous times trailers have spoilers for movies coming out. Even if the trailer doesn't have a \"spoiler\" it can have a scene from the end of the movie that you're waiting for that can count as a spoiler. An example without trying to do a spoiler in an actual movie is that you see a character from the movie that does something you haven't seen yet, but they just had a scene where they are supposed to be dead and now you know they aren't because they haven't done the scene from the trailer yet. \n\n\nSpoilers aside a lot of times people who do the trailer portray the movie incorrectly then how you do once you watch the movie. This causes you to go into the movie with a preconceived notion that the movie is about X and really it's about Y, but thinking it was about X makes you not enjoy the movie. A good example of this, for me personally and all my friends, was watchmen. That was one of the last trailers I watched and without having read the comics just judging by the trailer I thought it was going to be non stop action. \n\n\nAfter only watching movies based on titles/actors/posters it has dramatically increased my movie watching experience. You let the movie tell you the story without trying to make it fit your mindset of what it should be based on the trailer. Also, try to avoid reviews. A lot of reviews are from people who don't have the same likes and dislikes as you, but thinking a movie sucks because you read a bunch of people hating it can make you try to focus on all the negatives on the movie. \n\ntl;dr Try watching movies without seeing an reviews or trailers on it. You'll likely enjoy it much more.", "stickied": false, "subreddit_id": "t5_2qh3s", "title": "Not watching trailers made movies significantly better", "url": null, "author_name": "GottaBlast", "author_id": "8lgn1", "subreddit_name": "movies", "upvote_ratio": 0.82}